Repository: noah-nuebling/mac-mouse-fix
Catalog: Markdown/Strings/Acknowledgements.xcstrings
Source language: en
Languages: de

# 01:localization.progress
source: This document is `{localization_progress}` translated into `{current_language}`<br>To help translate, click [here]({url})!
de: Dieses Dokument ist zu `{localization_progress}` übersetzt nach `{current_language}`<br> Um beim Übersetzen zu helfen, klicke [hier]({url})!

# 02:localization.translate-prompt
source: [Help translate Mac Mouse Fix to different languages!]({url})
de: [Helfe dabei, Mac Mouse Fix in verschiedene Sprachen zu übersetzen!]({url})

# 03:intro
source: # 🙌 Acknowledgements Big thanks to everyone using Mac Mouse Fix and providing feedback. It's awesome and highly motivating to see so many people enjoy and engage with something I created. I want to especially thank the people and projects named in this document.
de: # 🙌 Danksagungen Vielen Dank an alle, die Mac Mouse Fix benutzen und Feedback geben. Es ist großartig und eine riesige Motivation zu sehen, wie so viele Leute sich mit etwas befassen und sich darüber freuen, was ich gemacht habe. Ich möchte mich besonders bei den Menschen und Projekten bedanken, die in diesem Dokument aufgeführt sind.

# 04:translations
source: ## 🌏 Translations Thanks for bringing Mac Mouse Fix to people around the globe! - 🇨🇳 Chinese translations by [@groverlynn]({url_1}) - 🇰🇷 Korean translations by [@jeongtae]({url_2}) - 🇻🇳 Vietnamese translations by [@nghlt]({url_3})
de: ## 🌏 Übersetzungen Danke, dass ihr Mac Mouse Fix zu Menschen auf der ganzen Welt gebracht habt. - 🇨🇳 Chinesische Übersetzungen von [@groverlynn]({url_1}) - 🇰🇷 Koreanische Übersetzungen von [@jeongtae]({url_2}) - 🇻🇳 Vietnamesische Übersetzungen von [@nghlt]({url_3})

# 05:money
source: ## 💰 Money Thanks so much to everyone who treated me to a milkshake and to all **{sales_count}** people who bought Mac Mouse Fix. Thanks to you, I can spend lots of time doing something I love. People who supported me by spending more than the standard price on Mac Mouse Fix receive a special mention here:
de: ## 💰 Geld Vielen Dank an alle, die mir einen Milchshake spendiert haben, und an alle **{sales_count}** Personen, die Mac Mouse Fix gekauft haben. Dank euch kann ich viel Zeit mit etwas verbringen, das ich sehr gerne mache. Menschen, die mich durch den Kauf von Mac Mouse Fix zu einem höheren Preis als dem Standardpreis unterstützt haben, erhalten hier eine besondere Erwähnung:

# 06:money.generous
source: ### ⭐️ Generous Contributors Thanks for your support! :)
de: ### ⭐️ Großzügige Unterstützer Danke für euren Beitrag! :)

# 07:money.very-generous
source: ### 🚀 Very Generous Contributors These people spent a lot more than the standard price and treated me to an **Incredible Milkshake**. (And some even left a message) Thanks for the *sugar rush*!
de: ### 🚀 Sehr Großzügige Unterstützer Diese Leute haben viel mehr als den Standardpreis ausgegeben und mir einen **unglaublichen Milchshake** spendiert. (Und manche haben sogar eine Nachricht hinterlassen) Danke für den *Zucker-Kick*!

# 08:money.github-sponsors
source: ### ❤️ GitHub Sponsors **Huge thanks** to [anyone]({url}) sponsoring me on GitHub! Hopefully I can get that milkshake factory one day thanks to you. :)
de: ### ❤️ GitHub Sponsoren Riesiges Dankeschön an [jeden]({url}) der mich auf GitHub sponsert! Hoffentlich kann ich mir eines Tages dank euch die Milchshakefabrik kaufen. :)

# 09:money.paypal-donations
source: ### ✨ PayPal Donations Lots of generous people bought me milkshakes on PayPal when Mac Mouse Fix was still entirely free. As thanks, I will provide you with a free license. Just shoot me an email with "Free License" in the subject and attach a screenshot of your donation. Thank you! *I might be slow to respond. If you already bought the app, just let me know the email that you bought the app with, and I will refund you.*
de: ### ✨ PayPal Spenden Viele großzügige Leute haben mir auf PayPal Milchshakes spendiert, als Mac Mouse Fix noch komplett kostenlos war. Als Dankeschön könnt ihr eine kostenlose Lizenz bekommen. Schickt mir einfach eine E-Mail mit "Free License" im Betreff und hängt einen Screenshot der Spende an. Danke euch! *Es dauert vielleicht eine Weile, bis ich antworte. Wenn ihr die App schon gekauft habt, dann lasst mich wissen, mit welcher E-Mail, und ich erstatte euch den Betrag zurück.*

# 10:software
source: ## 👾 Other Software
de: ## 👾 Andere Software

# 11:software.inspiration
source: **Software** that inspired Mac Mouse Fix: - [SteerMouse]({url_1}) - Pioneering mouse software for Mac, inspiring many features. There were moments when I thought "this is probably not possible", but then I saw "oh, SteerMouse does it", and three years later, I figured out how to implement it, too. - [Calftrail Touch]({url_2}) - The foundation for the "reverse engineering" work which powers Mac Mouse Fix's best-in-class and first-of-a-kind trackpad simulation! - [MOS]({url_3}) - Mac Mouse Fix's "High Scroll-Smoothness" option, the "App-Specific Settings" implementation, and more were inspired by MOS. - [SensibleSideButtons]({url_4}) - I copied its code for an early implementation of the "Go back/forward one page in Safari and other apps" feature, and also led me to discover the Calftrail Touch project. - [Gifski]({url_5}) - Greatly inspired the design and content of the [Readme.md]({url_6}) for Mac Mouse Fix. - [Vue Issue Helper]({url_7}) - Foundation for the design and technical implementation of [Mac Mouse Fix Feedback Assistant]({url_8}).
de: **Software**, die Mac Mouse Fix inspiriert hat: - [SteerMouse]({url_1}) - Wegweisende Maus-Software für Mac, die viele Funktionen inspiriert hat. Es gab Momente, in denen ich dachte: "Das ist wahrscheinlich unmöglich", aber dann hab ich gesehen "oh, SteerMouse macht es", und drei Jahre später habe ich herausgefunden, wie ich es auch umsetzen kann. - [Calftrail Touch]({url_2}) - Die Grundlage für die "Reverse Engineering"-Arbeit, die Mac Mouse Fix's erstklassige und einzigartige Trackpad-Simulation ermöglicht! - [MOS]({url_3}) - Viele Funktionen von Mac Mouse Fix, wie die Option "Hohe Scroll-Flüssigkeit" und die Implementierung des "App-spezifische Einstellungen" features, wurden von MOS inspiriert. - [SensibleSideButtons]({url_4}) - Ich habe den Code für eine frühe Implementierung der Funktion "Gehe eine Seite vor/zurück in Safari und anderen Apps" von SensibleSideButtons kopiert und bin dadurch auch auf das Calftrail Touch-Projekt gestoßen. - [Gifski]({url_5}) - Hat das Design und den Inhalt des [Readme.md]({url_6}) von Mac Mouse Fix stark inspiriert. - [Vue Issue Helper]({url_7}) - Grundlage für das Design und die technische Umsetzung von [Mac Mouse Fix Feedback Assistant]({url_8}).

# 12:software.libraries
source: Mac Mouse Fix was built with the help of these **great libraries**: - [ReactiveSwift]({url_1}) - Streams of values over time tailored for Swift - [CocoaLumberjack]({url_2}) - Fast & simple, yet powerful & flexible logging - [Swift Markdown]({url_3}) - Parse, build, edit, and analyze Markdown documents - [Sparkle]({url_4}) - A software update framework for macOS - [SnapKit]({url_5}) - Making Auto Layout easy on both iOS and macOS - [MASShortcut]({url_6}) - API and user interface for recording, storing & using system-wide keyboard shortcuts - [CGSInternal]({url_7}) - A collection of private CoreGraphics routines - Dependencies of Mac Mouse Fix's scripts:<br> [Update and statistics scripts]({url_8}) | [Markdown generator script]({url_9}) | [.strings file sync script]({url_10}) | ["State of Localization" script]({url_11}) - Dependencies of the [Mac Mouse Fix Feedback Assistant]({url_12}) web app [here]({url_13}) - Dependencies of the [Mac Mouse Fix Website]({url_14}) are available [here]({url_15})
de: Mac Mouse Fix wurde mithilfe dieser **hervorragenden Softwarebibliotheken** erstellt: - [ReactiveSwift]({url_1}) - Ströme von Werten im Laufe der Zeit. Maßgeschneidert für Swift. - [CocoaLumberjack]({url_2}) - Schnelles und einfaches, aber leistungsstarkes und flexibles Logging-System. - [Swift Markdown]({url_3}) - Analysiere, erstelle, bearbeite und analysiere Markdown-Dokumente. - [Sparkle]({url_4}) - Ein Software-Update-Framework für macOS. - [SnapKit]({url_5}) - Macht Auto Layout sowohl auf iOS als auch auf OS X einfach. - [MASShortcut]({url_6}) - API und Benutzeroberfläche zum Aufzeichnen, Speichern und Verwenden systemweiter Tastenkürzel - [CGSInternal]({url_7}) - Eine Sammlung privater CoreGraphics-Routinen - Abhängigkeiten der Skripte von Mac Mouse Fix:<br> [Update- und Statistikskripte]({url_8}) | [Markdown-Generierungsskript]({url_9}) | [.strings-Datei Synchronisierungsskript]({url_10}) | ["State of Localization"-Skript]({url_11}) - Abhängigkeiten der [Mac Mouse Fix Feedback Assistant]({url_12}) Web-App [hier]({url_13}) - Abhängigkeiten der [Mac Mouse Fix Website]({url_14}) findest du [hier]({url_15})
